<a href="https://colab.research.google.com/github/shruthi-jay/pandas/blob/main/pytho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

                                                  1. CREATING DATAFRAME  USING DIFFERENT METHODS

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.There are many ways of creating a dataframe. Few ways to create a dataframe are :

1.Create an empty DataFrame
    
       a) without any column name or indices and then appending columns one by one to it.

In [ ]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)  
df['Pokemon'] = ['Charmander', 'Pikachu', 'Squirtle']
df['Type'] = ['Fire','Electric','Water']
df['Hp'] = [58, 35, 44]
df

Empty DataFrame
Columns: []
Index: []

      Pokemon      Type  Hp
0  Charmander      Fire  58
1     Pikachu  Electric  35
2    Squirtle     Water  44

        b) with columns name only then appending rows one by one to it using append() method.

In [ ]:
import pandas as pd
# create an Empty DataFrame object With column names only
df = pd.DataFrame(columns = ['Nam', 'Type', 'Total'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Nam':'Bulbasaur','Type':'Grass','Total':318},ignore_index = True)
df = df.append({'Nam':'Ivysaur','Type':'Grass','Total':405},ignore_index = True)
df = df.append({'Nam':' Venusaur','Type':'Grass','Total':525},ignore_index = True)
df

Empty DataFrame
Columns: [Nam, Type, Total]
Index: []

         Nam   Type Total
0  Bulbasaur  Grass   318
1    Ivysaur  Grass   405
2   Venusaur  Grass   525

      c) with a column name and indices and then appending rows one by one to it using loc[] method

In [ ]:
import pandas as pd
# create an Empty DataFrame object With column names and indices 
df = pd.DataFrame(columns = ['Hero', 'Agility', 'Accelerated Healing'], index = ['a', 'b', 'c'])
print("Empty DataFrame\n", df)
# adding rows to an empty  dataframe at existing index
df.loc['a'] = [' 3-D Man','True','False']
df.loc['b'] = ['A-Bomb','False','True']
df.loc['c'] = ['Abe Sapien','True','True']
df

Empty DataFrame
   Hero Agility Accelerated Healing
a  NaN     NaN                 NaN
b  NaN     NaN                 NaN
c  NaN     NaN                 NaN

         Hero Agility Accelerated Healing
a     3-D Man    True               False
b      A-Bomb   False                True
c  Abe Sapien    True                True

2) Create DataFrame using List

       a) with index and column names.

In [ ]:
import pandas as pd
# list of strings
lst = ['Snow White and the Seven Dwarfs','Pinocchio','Fantasia']
# Calling DataFrame constructor on list  with indices and columns specified
df = pd.DataFrame(lst, index =['1937-12-21', '1940-02-09',' 1940-11-13'],columns =['Movie'])
df

                                       Movie
1937-12-21   Snow White and the Seven Dwarfs
1940-02-09                         Pinocchio
 1940-11-13                         Fantasia

       b) using multi-dimensional list

In [ ]:
import pandas as pd 
lst = [['The Light Between Oceans','Drama'], ['Queen of Katwe','Drama'],
       ['Doctor Strange','Adventure'], ['Moana','Adventure']]
    
df = pd.DataFrame(lst, columns =['Movie', 'Type'])
df

                      Movie       Type
0  The Light Between Oceans      Drama
1            Queen of Katwe      Drama
2            Doctor Strange  Adventure
3                     Moana  Adventure

3) Create Dataframe from Numpy Array

In [ ]:
import pandas as pd
import numpy as np
# creating the Numpy array
array = np.array([['Earth','Documentary'], ['Up','Adventure'],
                  ['The Proposal','Romantic Comedy'], ['Toy Story 3D Double Feature','Adventure'], 
                  ['The Princess and the Frog','Adventure']])
# creating a list of index names
index_values = ['A', 'B', 'C', 'D', 'E']
# creating a list of column names
column_values = ['Movie', 'Age']
# creating the dataframe
df = pd.DataFrame(data = array, 
                  index = index_values, 
                  columns = column_values)
# displaying the dataframe
print(df)

                         Movie              Age
A                        Earth      Documentary
B                           Up        Adventure
C                 The Proposal  Romantic Comedy
D  Toy Story 3D Double Feature        Adventure
E    The Princess and the Frog        Adventure

4)Create data frame using dictionary

       a) using default Constructor of pandas-Dataframe class

In [ ]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'])
df

                              Title Format  Episode
a  Fullmetal Alchemist: Brotherhood     Tv       64
b                         your name  Movie        1
c                    A Silent Voice  Movie        1

  b) from Dictionary with required columns only.

In [ ]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'],columns = ['Title', 'Format'])
df

                              Title Format
a  Fullmetal Alchemist: Brotherhood     Tv
b                         your name  Movie
c                    A Silent Voice  Movie

        c) from dictionary with key and simple value

In [ ]:
import pandas as pd
# dictionary
details = {
    'Inception' : 2010,
    'Avengers: Infinity War' : 2018,
    'Back to the Future' : 1985,
    'Spider-Man: Into the Spider-Verse' :2018
    }
#creating a Dataframe object from a list of tuples of key, value pair
df = pd.DataFrame(list(details.items()))  
df

                                   0     1
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

       d) from nested Dictionary.

In [ ]:
import pandas as pd
# dictionary with dictionary object in values i.e. nested dictionary
details = { 
    0 : {
        'Title' :'Like Stars on Earth',
        'Year' : 2007,
        'IMDb rating' :8.4
        },
    1 : {
       'Title' :'A Silent Voice',
        'Year' :2016,
        'IMDb rating' :8.2
        },
    2 : {
         'Title' :'Bill Burr: Im Sorry You Feel That Way',
        'Year' :2014 ,
        'IMDb rating' :8.4
        },
    3:  {
        'Title':'The Pianist'   ,
         'Year' :2002   ,
         'IMDb rating' : 8.5
        },
    4:  {
        'Title':'Austin Powers: International Man of Mystery'    ,
         'Year' : 1997   ,
         'IMDb rating' : 7
        },
    5:  {
        'Title':'Paper Tiger',
         'Year' :2019,
         'IMDb rating' : 8.2
         },
    6:  {
        'Title':'Avengers: Infinity War',
         'Year' : 2018   ,
         'IMDb rating' : 8.5
    },
}
  
# creating a Dataframe object from nested dictionaryin which inside dictionary key is act as index valueand column value is 0, 1, 2...
df = pd.DataFrame(details)
# swap the columns with indexes
df = df.transpose()
df

                                         Title  Year IMDb rating
0                          Like Stars on Earth  2007         8.4
1                               A Silent Voice  2016         8.2
2        Bill Burr: Im Sorry You Feel That Way  2014         8.4
3                                  The Pianist  2002         8.5
4  Austin Powers: International Man of Mystery  1997           7
5                                  Paper Tiger  2019         8.2
6                       Avengers: Infinity War  2018         8.5

5)  copying an existing dataframe

In [ ]:
df1 = df.head(3).copy()
df1

                                   Title  Year IMDb rating
0                    Like Stars on Earth  2007         8.4
1                         A Silent Voice  2016         8.2
2  Bill Burr: Im Sorry You Feel That Way  2014         8.4



---

                                                   2.  CREATE DATAFRAME FROM CSV FILE AND SAVE AS CSV FILE

    a) Load data from local drive

In [ ]:
import pandas as pd

from google.colab import files
uploaded = files.upload()

In [ ]:
import io

superheroes_df = pd.read_csv(io.BytesIO(uploaded['superheroes_power_matrix.csv']))
superheroes_df.head(2)

       b) From Github

In [ ]:
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols = ['Name','Type 1','Attack','Defense','Speed'])
pokemon_df.head(7)

2) Save Dataframe as CSV file using to_csv() method

In [ ]:
data = {'Name':['Brad Pitt','Christopher Walken','Daniel Day-Lewis','Dustin Hoffman'],
        'Oscar':[1,1,3,2],
        'BAFTA':[1,1,4,4]}
df = pd.DataFrame(data)
df.to_csv('my_dataset.csv')



---

                                                       3. GROUP BY OPERATIONS IN DATAFRAME

Pandas dataframe.groupby() function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes.

  1)   Splitting to groups

In [ ]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv')
gk = df.groupby('Type 1')
# Let's print the first entries in all the groups formed.
gk.first()

In [ ]:
gk.last()

 2) Select a Group

In [ ]:
gk.get_group('Water').head(5)



---

                                                         4.  COMBINING AND MERGING DATASETS

a) Concatenating DataFrame

    1)  using concat() only

In [ ]:
#to concat a dataframe, we use .concat() function .this function concat a dataframe and returns a new dataframe.
import pandas as pd 
data1 = {'Movie':['Ice Princess', 'The Princess Diaries', 'Monsters, Inc.', 'The Jungle Book 2'], 
        'Year':[2005, 2001, 2001, 2003], 
        'Genre':['Comedy','Comedy', 'Adventure', 'Adventure']} 
   
# Define dictionary 
data2 = {'Movie':['Monsters University', 'Frozen', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2013,2013, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 

 
# Convert the dictionarys into DataFrames  
df1= pd.DataFrame(data1,index=[0, 1, 2, 3])
df2 = pd.DataFrame(data2, index=[4, 5, 6, 7])
frames = [df1, df2]
final_1 = pd.concat(frames)
final_1

    2)  Setting axis along with concat() to get intersection of dataframe

In [ ]:
# set axes join = inner   to get the intersection of dataframe
data3 = {'Movie':['Monsters, Inc.', 'The Jungle Book 2', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2001, 2003, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 
df3 = pd.DataFrame(data3,index=[2, 3, 6, 7]) 
#set axes join = inner for intersection of dataframe
final_2 = pd.concat([df1, df3], axis=1, join='inner')
final_2

b) Merging DataFrame

    1)  Merge Two DataFrames on a Key

In [ ]:
# import the pandas library
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on='id')

    2)  Merge Two DataFrames on Multiple Keys

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on=['id','type'])

    3)  Merge Using 'how' Argument

In [ ]:
#left join
pd.merge(left, right, on='type', how='left')

In [ ]:
#right join
pd.merge(left, right, on='type', how='right')

In [ ]:
#outer join
pd.merge(left, right, on='type', how='outer')

In [ ]:
#inner join
pd.merge(left, right, on='type', how='inner')

3)  Join
  
   Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both dataframes.



---

                                                         5. TYPES  OF INDEXING IN DATA FRAME

Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame.Indexing can also be known as Subset Selection.

    1)  Indexing a Dataframe using indexing operator [] :

In [ ]:
# retrieving columns by indexing operator
first = pokemon_df["Name"]
first.head(7)

In [ ]:
#In order to select multiple columns, we have to pass a list of columns in an indexing operator.
first = pokemon_df[["Attack", "Speed"]]
first.head(6)

    2) indexing a DataFrame using .loc[ ] :

In [25]:
#In order to select a single row using .loc[], we put a single row label in a .loc function.
first = data.loc["Pikachu"]
second = data.loc["Rattata"]
  
  
print(first, "\n\n\n", second)

AttributeError: ignored

In [ ]:
#In order to select multiple rows, we put all the row labels in a list and pass that to .loc function.
# retrieving multiple rows by loc method

In [ ]:
#Selecting two rows and three columns

In [ ]:
# retrieving all rows and some columns by loc method
first = pokemon_df.loc[:, ["Name", "Attack"]]
first.head(5)

    3)  Indexing a DataFrame using .iloc[ ] :

In [ ]:
#Selecting a single row
now = pokemon_df.iloc[3] 
print(now)

In [ ]:
#Selecting multiple 
now= pokemon_df.iloc [[3, 5, 7]]
now

In [ ]:
#Selecting two rows and two 
now = data.iloc [[3, 4], [1, 2]]
now

In [ ]:
#Selecting all the rows and a some columns
now = pokemon_df.iloc [:, [1, 2]]
now.head(5)



---

                                                        6. AGGREGATION FUNCTION IN DATA FRAME

In [21]:
#Pandas groupby: mean()
#The aggregate function mean() computes mean values for each group. Here, pandas groupby followed by mean will compute mean population for each continent.
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols = ['Name','Type 1','Attack','Defense','Speed'])
pokemon_df.groupby("Speed").mean().head(3)

          Attack     Defense
Speed
5      47.500000  135.000000
10     76.666667   77.000000
15     47.777778   53.666667

In [ ]:
#2. Pandas groupby: sum
#The aggregating function sum() simply adds of values within each group.
pokemon_df.groupby("Type 1").sum().head(3)

In [ ]:
#3. Pandas groupby: size() The aggregating function size() computes the size per each group.
pokemon_df.groupby("Type 1").size()

In [ ]:
# Pandas groupby: count()
#The aggregating function count() computes the number of values with in each group.
pokemon_df.groupby("Type 1").count()

In [ ]:
# Pandas groupby: std()
#The aggregating function std() computes standard deviation of the values within each group.
pokemon_df.groupby("Type 1").std()

In [ ]:
#Pandas grouby: var()
#The aggregating function var() computes variance, an estimate of variability, for each column per group.
pokemon_df.groupby("Type 1").var()

In [ ]:
#. Pandas describe():
#The aggregating function describe() computes a quick summary of values per group. It computes the number of values, mean, std, the minimum value, maximum value and value at multiple percentiles.
pokemon_df.groupby("Type 1").describe()

In [ ]:
#Pandas groupby: n()
#The aggregating function nth(), gives nth value, in each group.
pokemon_df.groupby("Type 1").nth(10)

In [ ]:
#Pandas groupby: min() and max()
#min() and max() function are used to get minimum and maximum value per group respectively.
pokemon_df.groupby("Type 1").min().head(3)

In [ ]:
pokemon_df.groupby("Type 1").max().head(2)



---

                                                     7. Appending rows and columns to the Data frame

dataframe.append() function is used to append rows of other dataframe to the end of the given dataframe, returning a new dataframe object. Columns not in the original dataframes are added as new columns and the new cells are populated with NaN value.

    1)  appending one dataframe to another

In [ ]:
# Creating the first Dataframe using dictionary
df1 = pd.DataFrame({"movie":[ 'Inception', 'Avengers: Infinity War','Back to the Future','Spider-Man: Into the Spider-Verse'],
                         "year":[2010,2018,1985, 2018]})
# Creating the Second Dataframe using dictionary
df2 = pd.DataFrame({"movie":[ 'Like Stars on Earth','A Silent Voice','Bill Burr: Im Sorry You Feel That Way','The Pianist' ],
                    "year":[2007,2016,2014,2002]})
## to append df2 at the end of df1 dataframe
df1.append(df2)
df1

    2)   appending one dataframe to another with index value ignored

In [ ]:
df1.append(df2, ignore_index = True)
df1

    3) Append dataframe of different shape

In [ ]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu']})
left.append(right, ignore_index = True)
# the new cells are populated with NaN values.

    3) Add a single row using DataFrame.loc

In [ ]:
import pandas as pd
from numpy.random import randint
dict = {'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
        'type':['Grass','Water','Fire','Bug','Electric']
       }
df = pd.DataFrame(dict)
df.loc[len(df.index)] = ['Ratatta','Grass'] 
display(df)

    4)  Adding new column to existing DataFrame  by declaring a new list as a column

In [ ]:

# Import pandas package 
import pandas as pd
# Define a dictionary containing Students data
movi= {'Name': ['Snow White and the Seven Dwarfs', 'Pinocchio', 'Cinderella', 'Born Yesterday'],
        'Year': [1937,1940,1950,1993]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(movi)
# Declare a list that is to be converted into a column
Genre = ['Musical', 'Adventure', 'Drama', 'Romantic Comedy']
# Using 'Address' as the column name and equating it to the list
df['Genre'] = Genre
df

    5) Adding new column to existing DataFrame using DataFrame.insert()

It gives the freedom to add a column at any position we like and not just at the end. It also provides different options for inserting the column values.

In [ ]:
df.insert(2, "Rating", ['G','G','G','PG'], True)
df

    6)  Adding new column to existing DataFrame using  Dataframe.assign() method

This method will create a new dataframe with new column added to the old dataframe.

In [ ]:
import pandas as pd
movie= {'Name': ['Snow White and the Seven Dwarfs', 'Pinocchio', 'Cinderella', 'Born Yesterday'],
        'Year': [1937,1940,1950,1993]}  
df = pd.DataFrame(movie)
# Using 'Genre' as the column name and equating it to the list
df2 = df.assign(Genre = ['Musical', 'Adventure', 'Drama', 'Romantic Comedy'])
   
# Observe the result
df2

     7) Adding new column to existing DataFrame using Dictionary

We can use a Python dictionary to add a new column in pandas DataFrame. Use an existing column as the key values and their respective values will be the values for new column.

In [ ]:
import pandas as pd
  
# Define a dictionary containing Students data

  
# Define a dictionary with key values of
# an existing column and their respective
# value pairs as the # values for our new column.

# Convert the dictionary into DataFrame

  
# Provide 'Address' as the column name

  
# Observe the output
df

In [17]:
import pandas as pd
data1 = {'Name': ['Abomination', 'AntMan', 'Aquaman', 'BlackFlash'],
        'Weapon': ['False', 'False', 'False', 'False']}
# Define a dictionary with key values of an existing column and their respective value pairs as the # values for our new column.
# Convert the dictionary into DataFrame
flight= {'False': 'Abomination', 'Falsel': 'AntMan','Falsej':'Aquaman', 'Trueo':'BlackFlash'} 
df = pd.DataFrame(data1)
df['Flight'] =flight
df

          Name Weapon  Flight
0  Abomination  False   False
1       AntMan  False  Falsel
2      Aquaman  False  Falsej
3   BlackFlash  False   Trueo

                                                      8. Pivoting operations with Data Frame

                                                       9.Different possible operations to a Data Frame

1)  Slicing of rows

We can perform slicing operations to get the desired number of rows from within a given range.
With the help of slicing, we can perform various operations only on the specific subset of the data

In [ ]:

# slicing the number of rows 
df1 = pokemon_df[10:15]
df1

2) Selecting specific columns

To select a particular column or to select number of columns from the dataframe for further processing of data.

In [23]:
df2 = pokemon_df.loc[:, ['Name','Type 1']]
df2.head(5)

                    Name Type 1
0              Bulbasaur  Grass
1                Ivysaur  Grass
2               Venusaur  Grass
3  VenusaurMega Venusaur  Grass
4             Charmander   Fire

3) Summarize the data

In order to get insights from data, we must have a statistical summary of data. To display a statistical summary of the data such as mean, median, mode, std etc.

In [ ]:
pokemon_df.describe()

4) Sort data with respect to a column

In [ ]:
pokemon_df.sort_values(by ='Speed').head()

5) Display mean of each column

In [ ]:
pokemon_df.mean()

                                                         10. String Manipulations.

String manipulation is the process of changing, parsing, splicing, pasting, or analyzing strings

In [ ]:
# python script for create a dataframe for string manipulations
import pandas as pd
import numpy as np
  
df = pd.Series(['A Far Off Place', ' Bound by Honor', ' The Three Musketeers','Cabin Boy'])
df

1)lower()

 Converts all uppercase characters in strings in the DataFrame to lower case and returns the lowercase strings in the result.

In [ ]:
df.str.lower()

2) upper()

Converts all lowercase characters in strings in the DataFrame to upper case and returns the uppercase strings in result.

In [ ]:
df.str.upper()

3) strip()

If there are spaces at the beginning or end of a string, we should trim the strings to eliminate spaces using strip() or remove the extra spaces contained by a string in DataFrame

In [ ]:
df
print('\nAfter using the strip:')
df.str.strip()

4) split(‘ ‘)

Splits each string with the given pattern. Strings are split and the new elements after the performed split operation, are stored in a list.

In [ ]:

# split(pattern)
print(df)
print('\nAfter using the strip:')
print(df.str.split(','))
  
# now we can use [] or get() to fetch 
# the index values
print('\nusing []:')
print(df.str.split(',').str[0])
  
print('\nusing get():')
print(df.str.split(',').str.get(1))

5) len()

With the help of len() we can compute the length of each string in DataFrame & if there is empty data in DataFrame, it returns NaN.

In [ ]:
print("length of the dataframe: ", len(df))
print("length of each value of dataframe:")
df.str.len()

6) cat(sep=’ ‘)

 It concatenates the data-frame index elements or each string in DataFrame with given separator.

In [ ]:
print(df)
  
print("\nafter using cat:")
print(df.str.cat(sep='_'))
  
print("\nworking with NaN using cat:")
print(df.str.cat(sep='_', na_rep='#'))

7) repeat(value)

It repeats each element with a given number of times like below in example, there are two appearances of each string in DataFrame.

In [ ]:
df.str.repeat(2)

8) count(pattern)

It returns the count of the appearance of pattern in each element in Data-Frame like below in example it counts ‘n’ in each string of DataFrame and returns the total counts of ‘n’ in each string.

In [ ]:
print(df.str.count('o'))

9) isupper() and isnumeric()

isupper() checks whether all characters in each string in the Index of the Data-Frame in upper case or not, and returns a Boolean value.isnumeric() checks whether all characters in each string in the Index of the Data-Frame are numeric or not, and returns a Boolean value.

In [ ]:
print(df.str.isupper()) 
print("\n-----------\n")
print(df.str.isnumeric())

It swaps the case lower to upper and vice-versa

In [ ]:
df.str.swapcase()

10) find(pattern) and findall(pattern)

find(pattern)returns first position of the first occurrence of the pattern.findall(pattern) returns a list of all occurrences of the pattern

In [ ]:
# find(pattern) in result '-1' indicates there is no value matching with given pattern in particular row
print(df.str.find('n'))
print("\n-----------\n")
# findall(pattern) in result [] indicates null list as  there is no value matching with given pattern in particular row
print(df.str.findall('n'))